import React from "react";
import Picture1 from "../../images/Picture1";
import Picture2 from "../../images/Picture2";
import Picture3 from "../../images/Picture3";
import PlaceG from "../../images/PlaceG";
import Sundisc from "../../images/Sundisc";
import Rain from "../../images/Rain";
import Isten from "../../images/Isten";
  
const TextAbout = () => {
  return (
    <div>
        <Isten/>
      <div className="about__text">
        История проекта начинается в уже таком далёком 2019 году, именно летом
        того года были написаны первые две песни, которые позже выйдут под
        знамёнами Истень. За эти несколько лет было выпущено много материала, а
        в мире произошло очень много разных вещей, но одно осталось неизменным,
        главной темой творчества осталась любовь лирического героя к лирической
        же героине. При этом, героиня за этот срок менялась несколько раз, но
        это невозможно понять по песням, ведь все её появления согласуются между
        собой и не нарушают её общего образа. <br />
        <br />
        4 января 2020 года. Именно этот день принято мной считать отправной
        точкой в этом долгом путешествии по просторам самых разных музыкальных
        площадок. В этот день, я записал и выложил первую песню, автором которой
        стал Истень. Это уже не первый проект, в котором я делал музыку, но
        первый, в котором я решил ещё и петь.
        <br />
        <br />
        26 января на площадках оказался альбом "Сборник 1: Сломанный телефон",
        который считается первым альбомом да и полноценным релизом, в него вошли
        7 песен, которые были до этого просто залиты в ВКонтакте. С этого
        момента, вся музыка, которая у меня выходила, появилась на всех
        возможных площадках.
        <br />
        <br />
      </div>
        <Picture1/>
      <div className="about__text">
        Меньше чем через месяц, а именно 24 февраля, вышел первый ЕР, "Этот день
        24" - состоящий из трёх песен. А после него, почти сразу, 8 марта вышел
        тот же ЕР, но уже на гитаре, в котором уже привычная укулеле сменилась
        гитарой.
        <br />
        <br />
        После этого, пошли синглы, один из которых, оказался значительно
        популярнее других. "Дождь" - сингл, который вышел на гитаре и укулеле 17
        мая 2020 года и на данный момент является самым успешным из моих песен.
        Именно его, гитарную или укулеле версию, послушали примерно 75% тех, кто
        хоть раз слушал мои песни в ВКонтакте. Этот сингл стал моей визитной
        карточкой, хотя ставок на него не было никаких. Если быть честным, я до
        сих пор не могу понять почему именно он стал таким популярным и как так
        вышло, что короткая песня о конце света глазами двух влюблённых людей
        стала такой популярной. Но факт остаётся фактом.
        <br />
        <br />
      </div>
        <Rain/>
      <div className="about__text">
        13 июня того же года вышел новый ЕР "Солнечный диск", который, хоть и не
        сыскал большой популярности, но является одной из тех работ, которой я
        гордился на момент выхода.
        <br />
        <br />
        Дальше опять пошли несколько синглов, одним из которых, был "Глаза", всё
        ещё одна из моих любимых песен собственного сочинения, именно эту песню
        я включаю если кто то просит поставить что то своё и именно её я слушаю
        сам.
        <br />
        <br />
      </div>
        <Sundisc/>
      <div className="about__text">
        6 августа 2020 года выходит ЕР "Место", моё прощание с укулеле. Именно
        на этом ЕР, который вышел сразу в двух версиях, на гитаре и на укулеле,
        я последний раз играл песни на укулеле для этого проекта.
        <br />
        <br />
      </div>
        <PlaceG/>
      <div className="about__text">
        После этого опять пошли синглы, судьба которых повторила судьбу первых
        песен вышедших под именем Истень. Я почти целый год собирал материал и
        уже 28 июня 2021 года вышел мой второй альбом "Причины искусства". Этот
        альбом я писал в то время, когда я работал в ночную смену 2 через 2 по
        12 часов и одновременно с этим ходил на очные пары. Наверное именно
        поэтому, этот альбом стал для меня чем то очень особенным, потому что я
        всё ещё был одинок, у меня пошла череда неудач на личном фронте и именно
        поэтому, я полностью отдавался музыке.
        <br />
        <br />
        Следующим релизом оказался сингл/ЕР "Когда" вышедший 4 октября 2021
        года, состоявший из двух песен релиз, который тоже не сыскал
        популярности, но зато нашёл место в моей душе.
        <br />
        <br />
      </div>
        <Picture2/>
      <div className="about__text">
        И по уже сложившейся традиции, я начал подготовку к новому альбому.
        Песни выходили в ВКонтакте и ждали, когда я созрею. Созрел я в конце
        декабря 2021 года, сразу после окончания зачётной недели я принялся за
        альбом, но закончить к концу года его не смог. Зато я сделал это на
        новогодние праздники уже в 2022 году, после чего 20 января 2022 года
        вышел крайний, на данный момент, альбом "Грустные песни о успехах моей
        жизни".
        <br />
      </div>
      <Picture3/>
    </div>
  );
};

export default TextAbout;
